Tekla.Structures.Catalogs.CrossSectionPoint
The CrossSectionPoint class defines a point with possible chamfering information

Tekla.Structures.Catalogs.CrossSectionPoint.Chamfer
The chamfer for the cross section point.

Tekla.Structures.Catalogs.CrossSectionPoint.#ctor
Creates a new cross section point instance.

Tekla.Structures.Catalogs.CrossSectionPoint.#ctor(System.Double,System.Double,System.Double,Tekla.Structures.Model.Chamfer)
Creates a new cross section point instance.